makreck/Rase/firmware/esp32/include/app_config.hpp
/*
 * ==============================================================================
 *
 *  PROJECT:     "Rase" Radio Sensor Project,    ESP32-S3 Station Device Firmware
 *  COPYRIGHT:   (C)2025-2026 KKS-Elektronik,  M. Kreck, <makreck@googlemail.com>
 *
 *  This program is free software: you can redistribute it and/or modify it under
 *  the terms of the GNU General Public License as published by the Free Software
 *  Foundation, either version 3 of the License, or (at your option) any later
 *  version.
 *
 *  This program is distributed in the hope that it will be useful,   but WITHOUT
 *  ANY WARRANTY, without even the implied warranty of MERCHANTABILITY or FITNESS
 *  FOR A PARTICULAR PURPOSE, see the GNU General Public License for details.
 *
 *  You should have received a copy of the  GNU General Public License along with
 *  this program. If not, see <https://www.gnu.org/licenses/>.
 *
 * ==============================================================================
 */

#pragma once

// Note: Defined by "platformio.ini"
//#define SEEED_XIAO_S3
//#define ESP32_S3_ZERO
//#define ESP32_S3_WROOM_1
//#define ESP32_S3_SUPER_MINI
//#define ESP32_S2_MINI
//#define ESP32_WROVER_DEV
//#define ESP32_WROOM_DEV

#ifdef ESP32_S3_SUPER_MINI
    #define CHIP_TYPE "ESP32-S3 Super Mini"
    #define ESP32_S2S3
    #define ENABLE_JTAG_CONFIG_INTERFACE
    #define ENABLE_WATCHDOG

    //#define _HAS_BOARD_LED
    //#define _HAS_RGB_LED
    #define _HAS_NEOPIXEL_LED
    //#define _BOARD_LED_INVERTED

    #define _ENABLE_LCD
    #define _ENABLE_BUTTON
    //#define _ENABLE_SD_CARD
    //#define _ENABLE_USB_CDC
    //#define _ENABLE_COM1
    #define _ENABLE_COM2
    #define _ENABLE_WIFI
    //#define _ENABLE_BLUETOOTH
    #define _ENABLE_I2C_SENSOR
#endif


#ifdef SEEED_XIAO_S3
    #define CHIP_TYPE "Seeed Studio XIAO ESP32-S3"
    #define ESP32_S2S3
    #define ENABLE_JTAG_CONFIG_INTERFACE
    #define ENABLE_WATCHDOG

    #define _HAS_BOARD_LED
    //#define _HAS_RGB_LED
    //#define _HAS_NEOPIXEL_LED
    #define _BOARD_LED_INVERTED

    #define _ENABLE_LCD
    #define _ENABLE_BUTTON
    //#define _ENABLE_SD_CARD
    //#define _ENABLE_USB_CDC
    //#define _ENABLE_COM1
    //#define _ENABLE_COM2
    #define _ENABLE_WIFI
    //#define _ENABLE_BLUETOOTH
    #define _ENABLE_I2C_SENSOR
#endif

#ifdef ESP32_S3_ZERO
    #define CHIP_TYPE "Waveshare ESP32-S3 mini"
    #define ESP32_S2S3
    #define ENABLE_JTAG_CONFIG_INTERFACE
    #define ENABLE_WATCHDOG

    //#define _HAS_BOARD_LED
    //#define _HAS_RGB_LED
    #define _HAS_NEOPIXEL_LED
    //#define _BOARD_LED_INVERTED

    #define _ENABLE_LCD
    #define _ENABLE_BUTTON
    //#define _ENABLE_SD_CARD
    //#define _ENABLE_USB_CDC
    //#define _ENABLE_COM1
    //#define _ENABLE_COM2
    #define _ENABLE_WIFI
    //#define _ENABLE_BLUETOOTH
    #define _ENABLE_I2C_SENSOR
#endif

#ifdef ESP32_S3_WROOM_1
    #define CHIP_TYPE "ESP32-S3 Wroom"
    #define ESP32_S2S3
    #define ENABLE_JTAG_CONFIG_INTERFACE
    #define ENABLE_WATCHDOG

    #define _HAS_BOARD_LED
    //#define _HAS_RGB_LED
    #define _HAS_NEOPIXEL_LED
    //#define _BOARD_LED_INVERTED

    #define _ENABLE_LCD
    #define _ENABLE_BUTTON
    #define _ENABLE_USB_CDC
    #define _ENABLE_COM1
    //#define _ENABLE_COM2
    #define _ENABLE_WIFI
    //#define _ENABLE_BLUETOOTH
    #define _ENABLE_I2C_SENSOR
    #define _ENABLE_CAMERA
    #define _ENABLE_SD_CARD
    
#endif

#ifdef ESP32_WROOM_DEV
    #define CHIP_TYPE "ESP32 Wroom"
    #define _HAS_BOARD_LED
    // #define ESP32_S2S3
    // #define ENABLE_JTAG_CONFIG_INTERFACE
    #define ENABLE_WATCHDOG

    //#define _HAS_RGB_LED
    #define _HAS_NEOPIXEL_LED
    //#define _BOARD_LED_INVERTED

    #define _ENABLE_LCD
    #define _ENABLE_BUTTON
    //#define _ENABLE_SD_CARD
    //#define _ENABLE_USB_CDC
    //#define _ENABLE_COM1
    //#define _ENABLE_COM2
    #define _ENABLE_WIFI
    //#define _ENABLE_BLUETOOTH
    #define _ENABLE_I2C_SENSOR

#endif

#ifdef ESP32_WROVER_DEV
    #define CHIP_TYPE "ESP32 Wroover"
    // #define ESP32_S2S3
    // #define ENABLE_JTAG_CONFIG_INTERFACE
    #define ENABLE_WATCHDOG

    #define _HAS_BOARD_LED
    #define _HAS_RGB_LED
    #define _HAS_NEOPIXEL_LED
    //#define _BOARD_LED_INVERTED

    #define _ENABLE_LCD
    #define _ENABLE_BUTTON
    //#define _ENABLE_SD_CARD
    //#define _ENABLE_USB_CDC
    //#define _ENABLE_COM1
    //#define _ENABLE_COM2
    #define _ENABLE_WIFI
    //#define _ENABLE_BLUETOOTH
    #define _ENABLE_I2C_SENSOR
#endif

#ifdef ESP32_S2_MINI
    #define CHIP_TYPE "Wemos Lolin ESP32 S2 Mini"
    #define ESP32_S2S3
    // #define ENABLE_JTAG_CONFIG_INTERFACE
    // #define ENABLE_WATCHDOG

    //#define _HAS_BOARD_LED
    //#define _HAS_RGB_LED
    //#define _HAS_NEOPIXEL_LED
    //#define _BOARD_LED_INVERTED

    #define _ENABLE_LCD
    #define _ENABLE_BUTTON
    //#define _ENABLE_SD_CARD
    //#define _ENABLE_USB_CDC
    #define _ENABLE_COM1
    //#define _ENABLE_COM2
    //#define _ENABLE_WIFI
    //#define _ENABLE_BLUETOOTH
    #define _ENABLE_I2C_SENSOR
#endif
